<a href="https://colab.research.google.com/github/nirmalaraj77/SQL/blob/main/SQL_Notes_DataCamp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**EXERCISE - Count unique titles released 1990 to 1999 (inclusive) in English with rating of 'G', 'PG' or 'PG-13'**
SELECT COUNT (DISTINCT title) AS nineties_english_films_for_teens  
FROM films  
WHERE (release_year BETWEEN 1990 AND 1999)  
AND language = 'English'  
AND (certification IN ('G', 'PG', 'PG-13'));

#**EXERCISE - Which release_year had the most language diversity?**
SELECT release_year, COUNT (DISTINCT language) AS dist_language  
FROM films  
GROUP BY release_year  
ORDER BY dist_language DESC;

#**EXERCISE - Find the average budget and gross earnings for films each year after 1990 if the average budget is greater than 60 million**
SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross  
FROM films  
WHERE release_year > 1990  
GROUP BY release_year  
HAVING AVG(budget) > 60000000  
ORDER BY avg_gross DESC  
LIMIT 1;

#**EXERCISE - Determine the average gross domestic product (GDP) per capita by region in 2010**
SELECT region, AVG(gdp_percapita) AS avg_gdp  
FROM countries AS c  
LEFT JOIN economies AS e  
USING(code)  
WHERE year = 2010   
GROUP BY region  
ORDER by avg_gdp DESC  
LIMIT 10 ;

#**EXERCISE - Determine top 10 capital cities in Europe and Americas by city_perc, a percentage that calculates the "proper" population in a city as a percentage of the total population in the wider metro area, as follows:     city_proper_pop / metroarea_pop * 100**
-- Select fields from cities  
SELECT DISTINCT name, country_code, city_proper_pop, metroarea_pop, city_proper_pop / metroarea_pop * 100 AS city_perc  
FROM cities  
-- Use subquery to filter city name  
WHERE name IN  
(SELECT capital  
FROM countries  
WHERE continent LIKE '%Europe'  
OR continent LIKE '%America')  
-- Add filter condition such that metroarea_pop does not have null values  
AND metroarea_pop IS NOT NULL  
-- Sort and limit the result  
ORDER BY city_perc DESC  
LIMIT 10 ;

#**EXERCISE - Build a final query across 3 exercises that will contain three subqueries -- one in the SELECT clause, one in the FROM clause, and one in the WHERE clause. In the final exercise, your query will extract data examining the average goals scored in each stage of a match. Does the average number of goals scored change as the stakes get higher from one stage to the next?**

SELECT   
	-- Select the stage and average goals from s  
	s.stage,  
	ROUND(s.avg_goals,2) AS avg_goal,  
    -- Select the overall average for 2012/2013  
	(SELECT AVG(home_goal + away_goal) FROM match WHERE season = '2012/2013') AS overall_avg  
FROM   
	-- Select the stage and average goals in 2012/2013 from match  
	(SELECT  
         stage,  
         AVG(home_goal + away_goal) AS avg_goals  
     FROM match  
     WHERE season = '2012/2013'  
     GROUP BY stage) AS s  
WHERE   
	-- Filter the main query using the subquery  
	s.avg_goals > (SELECT AVG(home_goal + away_goal)   
                   FROM match WHERE season = '2012/2013');

#**EXERCISE - How do you get both the home and away team names into one final query result? Use JOINS, SUBQUERIES, CORRELATED SUBQUERIES and CTEs**
----

##**SUBQUERY in FROM**

SELECT  
	m.date,  
    -- Get the home and away team names  
    hometeam,  
    awayteam,  
    m.home_goal,  
    m.away_goal  
FROM match AS m  

-- Join the home subquery to the match table  
LEFT JOIN (  
  SELECT match.id, team.team_long_name AS hometeam  
  FROM match  
  LEFT JOIN team  
  ON match.hometeam_id = team.team_api_id) AS home  
ON home.id = m.id  

-- Join the away subquery to the match table  
LEFT JOIN (  
  SELECT match.id, team.team_long_name AS awayteam  
  FROM match  
  LEFT JOIN team  
  -- Get the away team ID in the subquery  
  ON match.awayteam_id = team.team_api_id) AS away  
ON away.id = m.id; 

----
##**CORRELATED SUBQUERY**
SELECT  
    m.date,  
    (SELECT team_long_name  
     FROM team AS t  
     WHERE t.team_api_id = m.hometeam_id) AS hometeam,  
    -- Connect the team to the match table
    (SELECT team_long_name  
     FROM team AS t  
     WHERE t.team_api_id = m.awayteam_id) AS awayteam,  
    -- Select home and away goals  
     m.home_goal,  
     m.away_goal  
FROM match AS m;  

----
##**CTEs**
-- Declare the home CTE  
WITH home AS (  
  SELECT m.id, m.date,     
  		 t.team_long_name AS hometeam, m.home_goal  
  FROM match AS m  
  LEFT JOIN team AS t   
  ON m.hometeam_id = t.team_api_id),  

-- Declare and set up the away CTE  
away AS (    
  SELECT m.id, m.date,   
  		 t.team_long_name AS awayteam, m.away_goal  
  FROM match AS m  
  LEFT JOIN team AS t   
  ON m.awayteam_id = t.team_api_id)  
-- Select date, home_goal, and away_goal  
SELECT   
	home.date,  
    home.hometeam,  
    away.awayteam,  
    home.home_goal,  
    away.away_goal  
-- Join away and home on the id column
FROM home  
INNER JOIN away  
ON home.id = away.id;

#**NOTE**
---
##Alter Column Data Type
ALTER TABLE books   
ALTER COLUMN date_text SET DATA TYPE date   
USING to_date(date_text, 'mm-dd-yyyy');

---

##Alter Column Name
Alter table existing_table_name  
RENAME COLUMN old_column_name TO new_column_name;

---

##Insert Data into Table
INSERT INTO table_name (column1, column2, column3, ...)  
VALUES (value1, value2, value3, ...);

----
##Create Table from another Table
SELECT x, y,z  
INTO table_b  
FROM table_a

---

##Delete View in Database
DROP VIEW [view_name] ;

----

##CREATE TABLE  
CREATE TABLE my_first_table (    
  first_column TEXT,   
  second_column INTEGER  
) ;  

---

##INSERT  
INSERT INTO my_first_table  
  (first_column, second_column) VALUES ('text value', 12) ;

#**SQL DATABASES**
---
### - Have Schema
### - Have Unique Identifier(s)
### - Queries output Result Sets
### - Field names format: small_letters
### - Field names format: "punc!tuation", "Capitalization", "table name"
### - KEYWORDS are capitalised
### - New lines, Capitalisation and Indentation not required
### - **[Holywell's SQL Style Guide](https://www.sqlstyle.guide/)**


#**Debugging SQL**
---
### - Code not pocessed in written order
### - Misspelling
### - Incorrect capitalisation
### - Incorrect or missing punctuation, comma errors

#**SQL Execution Order**

---



### - **Written Code**
SELECT

FROM 

WHERE

GROUP BY

HAVING 

ORDER BY

LIMIT

### - **Execution Order**
FROM

WHERE

GROUP BY

HAVING 

SELECT (alias defined here)

ORDER BY

LIMIT

#**SQL DATA TYPES**
---
### - VARCHAR
### - INT
### - FLOAT
### - NUMERIC
### - BINARY (images and fingerprints etc.)

#**SQL QUERY KEYWORDS**
---
##SELECT
##SELECT * (SELECT ALL)
##SELECT AS (aliasing)
##FROM
##LIMIT (Postgres) = TOP (SQL Server)

#**VIEW AS**
---
### - CREATE VIEW AS (virtual table - stores query code)
### - Views update sutomatically
### - No result set when creating a view
### - Query view (same as table) by selecting FROM the view

### - Create View
CREATE VIEW employee_hire_years AS  
SELECT id, name, year_hired  
FROM employees; 


### - Query View
SELECT id, name  
FROM employee_hire_years;

#**DISTINCT**
---
### - Combines data into unique values in a field
### - Use DISTINCT on multiple fields by writing DISTINCT first
SELECT DISTINCT author, genre  
FROM books;

#**COUNT( )**
---
### - COUNT ( ) includes only non-missing values, same as IS NOT NULL
### - COUNT (*) includes missing values
### - Alias to make result more readable

---

### - E.g. 
SELECT COUNT (birthdate) AS count_birthdates  
FROM people;

---

### - E.g. 
SELECT COUNT (name) AS count_names,   
COUNT (birthdate) AS count_birthdates    
FROM people;

---

### - E.g. 
SELECT COUNT (*) AS total_records    
FROM people;

---

#**COUNT, DISTINCT**
---
### - Count unique values
---
### - E.g. 
SELECT COUNT (DISTINCT bithdate) AS count_disctinct_birthdates  
FROM people;

#**WHERE**
---
### - Filter SQL Query
### - Use Comparision operators >, >=, <, <=, =, <>, !=
---
### - E.g. >
SELECT title    
FROM films    
WHERE release_year > 1960;  

---

### - E.g. =  
SELECT title  
FROM films  
WHERE release_year = 1960;

---

### - E.g. <>, != not equal to
SELECT title  
FROM films  
WHERE release_year <> 1960;

---

### - E.g. '  ' for Strings
SELECT title, country  
FROM films  
WHERE country = 'Japan';

#**COUNT, WHERE**
---
##**Count unique values**
---
### - E.g. 
SELECT COUNT (num_votes) AS films_over_1000K_votes  
FROM reviews  
WHERE num_votes > 100000;

---

### - E.g. 
SELECT COUNT (language) AS count_spanish  
FROM films  
WHERE language = 'Spanish'

#**MULTIPLE CRITERIA KEYWORDS**
---
#**AND, OR, BETWEEN (inclusive)**
---

### - **Put multiple clauses in brackets**
### - Use with WHERE
---
### - E.g. 
WHERE color = 'yellow' OR colour = 'red'  
WHERE (language = 'German') AND (release_year > 2000 AND release_year < 2010)  
WHERE (release = 94 OR release = 95) AND (cert = 'PG' OR cert = 'R')  
WHERE rel BETWEEN 94 AND 00  
WHERE (release_year BETWEEN 1994 AND 2000) AND (country ='UK')  
WHERE (rel=90 OR rel=99) AND (lang='Eng' OR lang='Spn') AND (gross>2000000)  
WHERE (rel BETWEEN 90 AND 00) AND (bud>1000000) AND (lan = 'Spn' OR lan = 'Fr')

#**IN**
---
### - **Combine multiple OR Keywords**
---
WHERE release_year = 1920 OR release_year = 1930 OR release_year = 1940 

can be combined as  

WHERE release_year IN (1920, 1930, 1940)

#**FILTER TEXT KEYWORDS**
---
### - Filter patterns with wildcards %, _ anywhere
### - Case sensitive

##**LIKE**

### - Percent % matches 0, 1 or many characters
### - E.g. Find names starting with 'Ade'
SELECT name  
FROM people  
WHERE name LIKE 'Ade%';  

###**Underscore_  matches single characters** 
### - E.g. Find names starting with 'Ev' or 3rd character 't'
SELECT name  
FROM people  
WHERE name LIKE 'Ev_' OR name like __t%

##**NOT LIKE**
### - E.g. (find names with third character not 't') and does not start with 'A.'
SELECT name  
FROM people  
WHERE name NOT LIKE '__t%'   
AND name NOT LIKE 'A.%' ;

#**IS NULL (Missing or unknown value)**
### - COUNT ( ) includes only non-missing values, same as IS NOT NULL
### - COUNT (*) includes missing values

### - E.g. 
SELECT name  
FROM people  
WHERE birthdate IS NULL ;  

### - E.g. 
SELECT COUNT (*) AS no_birthdates    
FROM people  
WHERE birthdate IS NULL ;  


#**IS NOT NULL**
### - E.g. 
SELECT COUNT (*) AS count_bithdates   
FROM people  
WHERE birthdate IS NOT NULL ;

#**AGGREGATE FUNCTIONS**
### - Data summarised with function name ON COLUMNS
### - Must use Aliasing

##**AVG ( )**

##**SUM ( )**

##**MIN ( )**

##**MAX ( )**

##**COUNT ( )**

### Mathematical
SELECT SUM (budget)  
FROM films ;

### - Non-Mathematical
SELECT MIN (country)  
FROM films ;

#**WHERE, AGGREGATE FUNCTIONS**
SELECT AVG (budget) AS avg_budget  
FROM films  
WHERE release_year >= 2000 ;

#**ROUND ( )**
### - Two parameters, number_to_round and decimal_places
### - Decimal place optional - default is 0
### - Can use negative to round before decimal point
SELECT ROUND (AVG (budget), 2) AS avg_budget  
FROM films  
WHERE release_year >= 2010;

#**ARITHMETIC and ALIASING**
### - Data calculated on Fields
### - Can Use Arithmetic Operators
### - Always use alias

### - E.g.
SELECT (1 + 1)  
SELECT (3 - 1)  
SELECT (3 * 4)  
SELECT (4 / 3 ) *answer is 1 (int)*  
SELECT (4.0 / 3.0) *use floats for precise answers*
<br>

SELECT (num_user + num_critics) AS num_user_critic  
FROM reviews ;

#**ORDER BY ASC**
#**ORDER BY DESC**

### - Sorting results
### - Can use Alias
### - Can use multiple fields after order by

### - E.g.
SELECT title, release_year, budget, gross  
FROM films
WHERE budget IS NOT NULL  
ORDER BY budget ASC, gross DESC ;

#**COUNT, GROUP BY, ORDER BY**

### - Group, Calculate and Order results
### - Use after FROM and before any other Keyword
### - Can refer to alias
### - Used with Aggregate Functions
### - Reduces non-grouped field to 1 record 
### - Must correspond to 1 group
### - All SELECT columns must appear in the GROUP BY clause or used in Aggregate Function
#### - Order affects how data is grouped


### - E.g. (GROUP BY single field)
SELECT certification, COUNT (title) AS title_count  
FROM films  
GROUP BY certification ;

### - E.g. (GROUP BY multiple fields)
SELECT certification, language, COUNT (title) AS title_count  
FROM films  
GROUP BY certification, language ;

### - E.g. 
SELECT certification, COUNT (title) AS title-count  
FROM films  
GROUP BY certification  
ORDER BY title_count DESC ;

### - E.g. 
SELECT release_year, AVG(duration) AS avg_duration  
FROM films  
GROUP BY release_year  
ORDER BY release_year ;

### - E.g. 
SELECT release_year, country, MAX(budget) AS max_budget  
FROM films  
GROUP BY release_year, country  
ORDER BY release_year, country ;

#**HAVING**

### - Filter grouped results
### - Cannot filter Aggregate Functions with WHERE
### - WHERE filters individual records vs HAVING filters group records
### - Cannot use Alias

### - E.g. 
SELECT release_year, COUNT (title) AS title_count  
FROM films  
GROUP BY release_year  
HAVING COUNT(title) > 10 ;

### - E.g. 
SELECT certification, COUNT (title) AS title_count  
FROM films  
WHERE certification IN ('G', 'PG', 'PG-13')  
GROUP BY certification  
HAVING COUNT (title) > 100  
ORDER BY title_count DESC  
LIMIT 10;

### - E.g. In what years average film duration over 2 hours?
SELECT release_year  
FROM films 
GROUP BY release_year
HAVING AVG(duration) > 120 ;

### - E.g. Which countries have the most varied film certifications?
SELECT country, COUNT (DISTINCT certification) AS certification_count  
FROM films  
GROUP BY country  
HAVING COUNT (DISTINCT certification) > 10 ;  

### - E.g. What countries have the highest average film budgets?
SELECT country, ROUND(AVG(budget), 2) AS average_budget  
FROM films  
GROUP BY country  
HAVING AVG(budget) > 1000000000  
ORDER BY average_budget DESC ;

#**JOINS | SQL RELATIONSHIPS | SET THEORY**
----

#**ADDITIVE JOINS**
* One-to-many - artists, authors

* One-to-one - fingerprints

* Many-to-many - languages and countries

----

#**SQL RELATIONSHIPS**
* Adds columns to left_table

* Put most relevant result on far left

* Results are ordered by left table column by default

* Fades out fields that do not match critea

* Fields with different names are added with original names - Fields with same name are added as duplicate columns with same name

* Can join with unique key or any other field(s)

* Must use aliased table.column_name to prevent SQL ambiguity error

* Use **ON** Keyword OR = to match unique fields with different names

* Use **USING ( )** Keyword to join same field names

----
#**INNER JOIN**

* **Joins records in left and right table(s) matching specified field(s)**

* E.g. Countries with both presidents and prime-ministers **(ON keyword)**  
SELECT p1.country, p1.continent, prime_minister, president    
FROM prime_ministers AS p1   
INNER JOIN presidents AS p2  
ON p1.country = p2.country ;

* E.g. Countries with both presidents and prime-ministers **(USING keyword)**  
SELECT p1.country, p1.continent, prime_minister, president      
FROM prime_ministers AS p1   
INNER JOIN presidents AS p2  
USING (country) ;  

----

#**MULTIPLE JOINS**
* **Chain inner joins to result of previous inner joins**

* Additional joins link to left_table

* Use additional joining conditions on multiple tables to prevent wrong pairing

* Joining ON multiple fields - add **AND** Keyword to **ON** clause to prevent wrong pairing

* E.g.   
SELECT c.code, name, region, e.year, fertility_rate, unemployment_rate    
FROM countries AS c    
INNER JOIN populations AS p  
ON c.code = p.country_code  
INNER JOIN economies AS e  
ON c.code = e.code   
AND p.year = e.year;  

----
# **OUTER JOINS**
1. FULL JOIN
2. LEFT JOIN
3. RIGHT JOIN
----

#**LEFT JOIN (LEFT OUTER JOIN)**

* **All records retained from left_table, only matching records retained from right_table**

* E.g. All countries with prime ministers and presidents if any
SELECT p1.country, president, prime_minister  
FROM prime_ministers AS p1  
LEFT JOIN presidents AS p2  
USING (country) ;

----

#**RIGHT JOIN (RIGHT OUTER JOIN)**

* **All records retained from right_table, only matching records shown from left_table**

* **Is not common - RIGHT JOIN can be recoded as LEFT JOIN**

----



#**FULL JOIN (FULL )**

* **Join all records on left_table and right_table** 
* Does not fade out null values
* Order of table matters
* **Don't specify common field from particular table in order to populate result w/o nulls**

* E.g. All countries with presidents and / or prime ministers  
SELECT country, president, prime_minister  
FROM prime_ministers AS p1  
FULL JOIN presidents AS p2  
USING (country) ;  

----
#**CROSS JOIN**

* **Creates all possible combinations of two tables**

* Use WHERE to specify fields

* E.g. Meetings of prime ministersin Asia with presidents in South America  
SELECT prime_minister, president  
FROM prime_ministers AS p1  
CROSS JOIN presidents AS p2
WHERE p1.continent = 'Asia'  
AND p2.continent = South America ;

----
#**SELF JOIN**

* **Joins table with itself to compare parts of same table**
* Must use Aliasing
* No dedicated syntax, use other joins
* Use AND | OR clauses and calculations / exclusions to eliminate unwanted / duplicate results

### - E.g, Prime minsters meet with other prime ministers on same continents
SELECT p1.country AS country1,   
p2.country AS country2,   
p1.continent     
FROM prime_ministers AS p1  
INNER JOIN prime_ministers as p2  
ON p1.continent = p2.continent 
AND p1.country <> p2.country ;


### - E.g. Compare population growth
SELECT  
p1.country_code,   
p1.size AS size2010,   
p2.size AS size2015  
FROM populations AS p1  
INNER JOIN populations AS p2
ON p1.country_code = p2.country_code
WHERE p1.year = 2010  
AND p1.year =  p2.year - 5;

----
#**UNION | UNION ALL | INTERSECT | EXCEPT**

* UNION - returns single record if two or more records are identical

* UNION ALL - returns all records including duplicates

* INTERSECT - returns only **records** that exist in both tables

* EXCEPT - returns records from left_table that do not exist in right_table


**SET THEORY OPERATIONS**
* Number of selected columns and data types must be identical

* Results will be combined under selected or aliased field names from left query

* Do not require field(s) to join

* Does not select and compare but stacks / binds


* **Syntax**  
SELECT *   
FROM left_table  
UNION | UNION ALL | INTERSECT | EXCEPT  
SELECT *  
FROM right_table ;

----
#**SEMI JOIN**
### - Chooses records in left_table where condition is met in right_table
### - Returns all values of col1_left_table where the values are present in col2_right_table

### - E.g. Presidents of countries that gained independenc before 1800
SELECT country, continent, president  
FROM presidents   
WHERE country IN    
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


### - E.g. Identify languages spoken in the Middle East
SELECT DISTINCT name  
FROM languages  
WHERE code IN  
   (SELECT code  
   FROM countries  
   WHERE region = 'Middle East')  
ORDER BY name;  


#**SEMI JOIN | ANTI JOIN (SUBQUERY INSIDE WHERE)**

* Semi Join - returns all values of left_table where the values ARE present in right_table

* Anti Join - returns all values of left_table where the values ARE NOT present in right_table


* E.g. Presidents of countries in the Americas that were founded after 1800  
SELECT country, continent, president  
FROM presidents   
WHERE continent LIKE '%America'  
AND country **NOT IN**  
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


* E.g. Identify currencies of Oceanian countries (countries not in the currencies tble)  
SELECT code, name  
FROM countries  
WHERE continent = 'Oceania'    
AND code NOT IN  
   (SELECT code  
   FROM currencies);  

* E.g. Presidents of countries in the Americas that were founded after 1800   
SELECT country, continent, president  
FROM presidents   
WHERE continent LIKE '%America'  
AND country **NOT IN**  
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


* E.g. Identify currencies of Oceanian countries (countries not in the currencies tble)  
SELECT code, name  
FROM countries  
WHERE continent = 'Oceania'    
AND code NOT IN  
   (SELECT code  
   FROM currencies);

#**SUBQUERIES INSIDE WHERE**

### - Semi joins and Anti joins
### - Nested SQL Queries
### - Use filter functions
### - No new columns added (vs Additive Joins)
### - Subquery result must be same data type as the filter

### - Syntax:
SELECT *  
FROM some_table  
WHERE some_field IN (NOT IN)  
  (include subquery here) ;


#**SEMI JOIN**
### - Chooses records in left_table where condition is met in right_table
### - Returns all values of col1_left_table where the values are present in col2_right_table

### - E.g. Presidents of countries that gained independenc before 1800
SELECT country, continent, president  
FROM presidents   
WHERE country IN    
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


### - E.g. Identify languages spoken in the Middle East
SELECT DISTINCT name  
FROM languages  
WHERE code IN  
   (SELECT code  
   FROM countries  
   WHERE region = 'Middle East')  
ORDER BY name;  


#**ANTI JOIN**
### - Returns all values of col1_left_table where the values are NOT present in col2_right_table

### - E.g. Presidents of countries in the Americas that were founded after 1800
SELECT country, continent, president  
FROM presidents   
WHERE continent LIKE '%America'  
AND country **NOT IN**  
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


### - E.g. Identify currencies of Oceanian countries (countries not in the currencies tble)
SELECT code, name  
FROM countries  
WHERE continent = 'Oceania'    
AND code NOT IN  
   (SELECT code  
   FROM currencies);

#**SUBQUERIES INSIDE WHERE, SELECT**
### - Subquery requires Alias


### - E.g. Count number of monarchs in monarchs table listed for each continent in states table
SELECT DISTINCT continent,  
  (SELECT COUNT (*)  
  FROM monarchs    
  WHERE states.continent = monarchs.continent) AS monarch_count  
  FROM states ;


### - E.g. Which countries had high average life expectancies in 2015 (> 1.15 times avg)
SELECT *  
FROM populations  
WHERE life_expectancy > 1.15 *  
  (SELECT AVG(life_expectancy)  
   FROM populations  
   WHERE year = 2015)   
     AND year = 2015;


### - E.g. Return the name, country_code and urbanarea_pop for all capital cities (not aliased)
SELECT name, country_code, urbanarea_pop  
FROM cities  
WHERE name IN  
  (SELECT capital
   FROM countries)  
ORDER BY urbanarea_pop DESC;


#**Join vs Subquery**

### - E.g. Select the nine countries with the most cities appearing in the cities table

### - Left Join Method
SELECT countries.name AS country, COUNT(*) AS cities_num  
FROM countries  
LEFT JOIN cities  
ON countries.code = cities.country_code  
GROUP BY country  
ORDER BY cities_num DESC, country  
LIMIT 9;

### - Subquery Method
SELECT countries.name AS country,  
  (SELECT COUNT (*)   
  FROM cities  
  WHERE cities.country_code = countries.code) AS cities_num  
FROM countries  
ORDER BY cities_num DESC, country  
LIMIT 9;

#**SUBQUERY INSIDE FROM**
### - Add multiple statements to FROM by adding comma,
### - Include subquery as temporary table in FROM clause and SELECT from it
### - Returns Deplicates, drop by using DISTINCT
### - *Subquery field names do not have to match*


### - Syntax
SELECT left_table.id, left_val  
FROM left_table, right_table  
WHERE left_table.id = right_table.id ;  

### - E.g. All continents with monarchs and most recent country to gain independence in that continent
SELECT DISTINCT monarchs.continent, sub.most_recent
FROM monarchs,   
(SELECT continent, MAX (indep_year) AS most_recent  
FROM states  
GROUP BY continent) AS sub    
WHERE monarchs.continent = sub.continent  
ORDER BY continent ;

### - E.g. Determining number of languages spoken for each country with the country's local_name, which is a field only present in the countries table and not in the languages table  
SELECT DISTINCT local_name, sub.lang_num    
FROM countries,     
  (SELECT code, COUNT(*) AS lang_num  
  FROM languages    
  GROUP BY code) AS sub   
WHERE countries.code = sub.code  
ORDER BY lang_num DESC ;  

### - E.g. Determine unemployment rate for countries in 2015. Not interested in countries with "Republic" or "Monarchy" as their form of government
SELECT code, inflation_rate, unemployment_rate  
FROM economies  
WHERE year = 2015    
AND code NOT IN    
 (SELECT code  
 FROM countries  
 WHERE gov_form LIKE '%Monarchy%'   
 OR gov_form LIKE '%Republic%')  
ORDER BY inflation_rate;

#**CASE STATEMENTS (CATEGORISING DATA)**

* WHEN | THEN | ELSE | END (AS)

### - Syntax
CASE WHEN x = 1 THEN 'a'  
     WHEN x = 2 THEN 'b'  
     ELSE 'c' END AS new_column  

### - E.g. CASE statements comparing column values
SELECT  
-- Select the date of the match  
date,    
-- Identify home wins, losses, or ties  
CASE WHEN home_goal > away_goal THEN 'Home win!'  
     WHEN home_goal < away_goal THEN 'Home loss :('   
     ELSE 'Tie' END AS outcome  
FROM matches_spain;

### - E.g. CASE statements comparing two column values part 2
SELECT    
m.date,  
t.team_long_name AS opponent,  
CASE WHEN m.home_goal < m.away_goal THEN 'Barcelona win!'  
     WHEN m.home_goal > m.away_goal THEN 'Barcelona loss :('   
     ELSE 'Tie' END AS outcome  
FROM matches_spain AS m    
-- Join teams_spain to matches_spain  
LEFT JOIN teams_spain AS t   
ON m.hometeam_id = t.team_api_id  
WHERE m.awayteam_id = 8634;

#**COMPLEX CASE STATEMENTS (FILTERING DATA)**

### - WHEN, THEN, ELSE, NULL, END (AS), END =
### - Use multiple CASE statements (creates multiple columns)
### - Add multiple logical conditions to WHEN clause
### - Add specific filters to WHERE clause to control exclusions
### - Use ELSE NULL 
### - Filter entire CASE statement as a Column by incluing CASE statement without Alias in WHERE and choose what to include or exclude

### - E.g. Filter by team_api_id
SELECT date, home_team_api_id, away_team_api_id,   
CASE WHEN home_team_api_id = 8455 AND home_team_goal > away_team_goal  
          THEN 'Chelsea Home Win!'  
     WHEN away_team_api_id = 8455 AND home_team_goal < away_team_goal    
          THEN 'Chelsea Away Win!'  
     ELSE 'Loss or Tie :('   
END AS outcome  
FROM match  
WHERE home_team_api_id = 8455 OR away_team_api_id = 8455 ;

### - E.g. Filter entire CASE statement (don't ALIAS statement inside WHERE)
SELECT *  
FROM table  
WHERE  
CASE WHEN a > 5 THEN 'Keep'  
     WHEN a <= 5 THEN 'Exclude' END = 'Keep';  

### - E.g. Filter entire CASE statement (don't ALIAS statement inside WHERE)
SELECT date, season,   
CASE WHEN home_team_api_id = 8455 AND home_team_goal > away_team_goal  
          THEN 'Chelsea Home Win!'  
     WHEN away_team_api_id = 8455 AND home_team_goal < away_team_goal    
          THEN 'Chelsea Away Win!'  
END AS outcome  
FROM match  
WHERE CASE WHEN home_team_api_id = 8455 AND home_team_goal > away_team_goal  
          THEN 'Chelsea Home Win!'  
     WHEN away_team_api_id = 8455 AND home_team_goal < away_team_goal    
          THEN 'Chelsea Away Win!'  
END IS NOT NULL ;


### - E.g. Filter Entire CASE statement (don't ALIAS statement inside WHERE)
-- Bologna team_api_id 9857
-- Select the season, date, home_goal, and away_goal columns  
SELECT season, date, home_goal, away_goal  
FROM matches_italy
WHERE   
-- Exclude games not won by Bologna  
CASE WHEN hometeam_id = 9857 AND home_goal > away_goal THEN 'Bologna Win'  
     WHEN awayteam_id = 9857 AND away_goal > home_goal THEN 'Bologna Win'   
     END IS NOT NULL ;

#**COMPLEX CASE STATAEMTS (AGGREGATE FUNCTIONS)**

### - Use WHEN 
### - Include CASE inside Aggregate Function

## - CASE WHEN with COUNT
### - THEN clause returns column identifying unique match id instead of text string 
### - Add multiple CASE statements (creates multiple columns) 
### - Counts every id returned by CASE statement when inside COUNT function
### - Can return anything, no., text or column. SQL COUNTs no. of rows returned by CASE statement

SELECT season,   
COUNT (CASE WHEN home_team_api_id = 8650  
            AND  home_team_goal > away_team_goal  
            THEN id END) AS home_wins,   
COUNT (CASE WHEN away_team_api_id = 8650    
            AND  away_team_goal > home_team_goal    
            THEN id END) AS home_wins            
FROM match  
GROUP BY season;  

## - CASE WHEN with SUM
### - ELSE clause assumed to be null
### - Add multiple CASE statements (creates multiple columns) 
### - Sums every goal returned by CASE statement when inside SUM function

SELECT season,   
SUM (CASE WHEN home_team_api_id = 8650  
          THEN home_team_goal END) AS home_goals,   
SUM (CASE WHEN away_team_api_id = 8650    
            THEN away_team_goal END) AS away_goals            
FROM match  
GROUP BY season;

## - CASE WHEN with AVG, ROUND (same as SUM)
SELECT season,   
ROUND (AVG (CASE WHEN home_team_api_id = 8650  
          THEN home_team_goal END), 2) AS avg_home_goals,   
ROUND (AVG (CASE WHEN away_team_api_id = 8650    
            THEN away_team_goal END), 2) AS avg_away_goals            
FROM match  
GROUP BY season;

## - Calculate Percentages with CASE WHEN with AVG, ROUND (same as SUM)
### - Requires specific structure
### - Syntax:
AVG(CASE WHEN condition_is_met THEN 1  
WHEN condition_is_not_met THEN 0 END)  

### - What percentage of Liverpool's games did they win in each season
### - Structure THEN clause to return 1 for win and 0 for loss
### - All other matches, games not involving Liverpool, ties - are excluded 

SELECT season,   
ROUND (AVG (CASE WHEN home_team_api_id = 8650    
                 AND home_team_goal > away_team_goal   
                 THEN 1  
                 WHEN home_team_api_id = 8650    
                 AND home_team_goal < away_team_goal   
                 THEN 0  
                 END), 2) AS pct_homewins,
ROUND (AVG (CASE WHEN away_team_api_id = 8650    
                 AND away_team_goal > home_team_goal   
                 THEN 1  
                 WHEN away_team_api_id = 8650    
                 AND away_team_goal < home_team_goal   
                 THEN 0  
                 END), 2) AS pct_awaywins
FROM match  
GROUP BY season;

## - COUNT and CASE WHEN with multiple conditions
### - Python can calculate SUM of logical values (TRUE/FALSE) directly
### - SQL has to convert TRUE/FALSE values into 1 and 0 before calculating

### - E.g. Use country and match tables to determine total number of matches won by the home team in each country during the 2012/2013, 2013/2014, and 2014/2015 seasons

SELECT   
c.name AS country,  
-- Sum the total records in each season where the home team won  
SUM(CASE WHEN m.season = '2012/2013' AND m.home_goal > m.away_goal   
        THEN 1 ELSE 0 END) AS matches_2012_2013,  
SUM(CASE WHEN m.season = '2013/2014' AND m.home_goal > m.away_goal   
        THEN 1 ELSE 0 END) AS matches_2013_2014,  
SUM(CASE WHEN m.season = '2014/2015' AND m.home_goal > m.away_goal   
        THEN 1 ELSE 0 END) AS matches_2014_2015  
FROM country AS c
LEFT JOIN match AS m  
ON c.id = m.country_id  
-- Group by country name alias  
GROUP BY country;  


### - E.g. Examine no. of ties in each country for 2013/2014, 2014/2015 seasons
SELECT   
c.name AS country,  
-- Round the percentage of tied games to 2 decimal points  
ROUND (AVG(CASE WHEN m.season='2013/2014' AND m.home_goal = m.away_goal THEN 1  
WHEN m.season='2013/2014' AND m.home_goal != m.away_goal THEN 0  
END),2) AS pct_ties_2013_2014,    
ROUND (AVG (CASE WHEN m.season='2014/2015' AND m.home_goal = m.away_goal THEN 1  
WHEN m.season='2014/2015' AND m.home_goal != m.away_goal THEN 0  
END),2) AS pct_ties_2014_2015  
FROM country AS c  
LEFT JOIN matches AS m  
ON c.id = m.country_id  
GROUP BY country;

#**SUBQUERY**
---
### - Query nested within another query (that can be run on its own)
### - Intermediary data transformation to data before selecting, filtering, calculating
### - Compare summarised values to detailed data
### - Structure and reshape data
### - Combine data that cannot be joined
### - SELECT statement in paranthesis contained in another complete statement
### - Place in any part of query, SELECT, FROM, WHERE, GROUP BY
### - Only processed once - SQL processes subquery and uses result for outer query
### - Subquery can have own filtering conditions
### - FORMAT- Line up SELECT, FROM, WHERE and GROUP BY 
### - ANNOTATE /* This query filters for col1 = 2 and only selects data from table1 */
### - COMMENT --
### - INDENT subquery 
### - FILTER consistently within main and subqueries

#**SUBQUERY INSIDE WHERE**
---

### - Returns single column
---

### - E.g. 
SELECT home_goal  
FROM match  
WHERE home_goal > (  
SELECT AVG (home_goal)  
FROM match);

---

### - E.g. Which matches in 2012/2013 season scored home goals higher than overall average
SELECT date, hometeam_id, awayteam_id, home_goal, away_goal  
FROM match  
WHERE season = '2012/2013'  
AND home_goal > (SELECT AVG (home_goal)   
FROM match) ;

#**SUBQUERY FILTERING WITH IN / NOT IN**
### - Generates a one column reference list for main query 
### - As long as values in list match a column in main query - no need for join
---
### - E.g. Which teams are part of Poland's league
SELECT team_long_name, team_short_name AS abbr  
FROM team  
WHERE   
team_api_id IN  
(SELECT hometeam_id  
FROM match  
WHERE country_id = 15722);   

---

### - E.g. Generate list of matches where total goals scored (for both teams in total) is more than 3 times the average for games in the matches_2013_2014 table
SELECT   
-- Select the date, home goals, and away goals scored  
date,  
home_goal,  
away_goal  
FROM  matches_2013_2014  
-- Filter for matches where total goals exceeds 3x the average  
WHERE (home_goal + away_goal) >    
(SELECT 3 * AVG(home_goal + away_goal)  
FROM matches_2013_2014);   

---

### - E.g. Generate list of teams that never played in their home city
SELECT  
-- Select the team long and short names  
team_long_name,  
team_short_name  
FROM team   
-- Exclude all values from the subquery  
WHERE team_api_id NOT IN   
(SELECT DISTINCT hometeam_id FROM match);  

---

### - E.g. Generate list of teams that scored 8 or more goals in a home match
SELECT  
-- Select the team long and short names  
team_long_name,  
team_short_name  
FROM team  
-- Filter for teams with 8 or more home goals  
WHERE team_api_id IN   
(SELECT hometeam_id   
FROM match  
-- Subquery has own filtering condition
WHERE home_goal >= 8);

#**SUBQUERY INSIDE FROM**
---
### - Returns multiple columns / tables
### - Create multiple subqueries in one FROM statement
### - Each subquery MUST have Alias
### - Each subquery can join to each other 
### - Can join subquery to a table in FROM (with common joining column) 
### - Restructure, Transform and Pre-filter data before selecting
### - Calculate aggregates of aggregates
---

### - E.g. Which 3 teams has highest avg home goals in 2011/2012
### - Step 1 - Calculate AVG for each team
### - Step 2 - Get the 3 highest AVG values
### - Create query (that becomes subquery) to gt home goal average or each team

SELECT   
t.team_long_name AS team,   
AVG (m.home_goal) AS home_avg    
FROM match AS m  
LEFT JOIN team as t    
ON m.hometeam_id = t.team_api_id  
WHERE season = '2011/2012'  
GROUP BY team ;


### - Get only top 3 teams - place query in FROM statement in outer query
### - Table alias excluded in main query as main query is extracting from subquery

SELECT team, home_avg  
FROM (SELECT   
t.team_long_name AS team,   
AVG (m.home_goal) AS home_avg    
FROM match AS m  
LEFT JOIN team as t    
ON m.hometeam_id = t.team_api_id  
WHERE season = '2011/2012'  
GROUP BY team) AS subuery  
ORDER by home_avg DESC  
LIMIT 3;

----

### - E.g. Generate subquery using match table and join subquery to country table to calculate information about matches with 10 or more goals in total

SELECT  
-- Select country name and the count match IDs  
c.name AS country_name,  
COUNT(sub.id) AS matches  
FROM country AS c  
-- Inner join the subquery onto country  
-- Select the country id and match id columns  
INNER JOIN (SELECT country_id, id   
           FROM match  
           -- Filter the subquery by matches with 10+ goals  
           WHERE (home_goal + away_goal) >=10) AS sub  
ON c.id = sub.country_id  
GROUP BY country_name;  

----
### - E.g. When and during which seasons, how many were home versus away goals
### - Table alias excluded in main query as main query is extracting from subquery
SELECT  
-- Select country, date, home, away and total goals from the subquery  
country,  
date,  
home_goal,  
away_goal,  
total_goals  
FROM   
-- Select country name, date, home_goal, away_goal, and total goals in the subquery  
(SELECT c.name AS country,   
m.date,   
m.home_goal,   
m.away_goal,  
(m.home_goal + m.away_goal) AS total_goals  
FROM match AS m  
LEFT JOIN country AS c  
ON m.country_id = c.id) AS subq  
-- Filter by total goals scored in the main query  
WHERE total_goals >= 10  
ORDER BY total_goals DESC;

#**SUBQUERY INSIDE SELECT**
---
### - Select single aggregate value (cannot include aggregate value in ungrouped SQL query)
### - Complex mathematical calculations
### - Subquery needs to return a single value
### - Correct placemeent of data filters in both main and subquery

----

### - E.g. Calculate total no. of matches played in each season to total no. of overall matches. 

### - Step 1. Calculate overall matches 
SELECT COUNT (id) FROM match;   
ANSWER IS 25,979

### - Step 2. Put the answer in query
SELECT season, COUNT (id) as matches, 25979 as total_matches  
FROM match  
GROUP BY season  
ORDER By season; 

### - OR add ubquery directly to SELECT statement
SELECT season, COUNT (id) as matches,   
(SELECT COUNT (id) FROM match) as total_matches    
FROM match  
GROUP BY season  
ORDER BY season ;

----

### - E.g. Mathematical calculations
SELECT  
date,   
(home_goal + away_goal0 AS goals,  
(home_goal + away_goal) - 
(SELECT ROUND (AVG (home_goal + away_goal), 2)    
FROM match  
WHERE season = '2011/2012') AS diff,   
FROM match  
WHERE season = '2011/2012'; 

----

### - E.g. Construct query to calculate avg no. of goals per match in each country's league
SELECT   
l.name AS league,  
-- Select and round the league's total goals  
ROUND(AVG (m.home_goal + m.away_goal), 2) AS avg_goals,  
-- Select & round the average total goals for the season  
(SELECT ROUND (AVG(home_goal + away_goal), 2)   
FROM match  
WHERE season = '2013/2014') AS overall_avg  
FROM league AS l  
LEFT JOIN match AS m 
ON l.country_id = m.country_id  
-- Filter for the 2013/2014 season  
WHERE season = '2013/2014'  
GROUP BY l.name;  

----

### - E.g. Add column to directly compare values by subtracting overall avg from subquery
SELECT   
-- Select the league name and average goals scored 
l.name AS league,  
ROUND(AVG(m.home_goal + m.away_goal),2) AS avg_goals,  
-- Subtract the overall average from the league average  
ROUND(AVG(m.home_goal + m.away_goal) -   
(SELECT AVG(home_goal + away_goal)  
           FROM match   
           WHERE season = '2013/2014'),2) AS diff  
FROM league AS l 
LEFT JOIN match AS m  
ON l.country_id = m.country_id  
-- Only include 2013/2014 results  
WHERE m.season = '2013/2014'  
GROUP BY l.name;

#**CORRELATED SUBQUERIES**
----
### - Uses values from the outer query to generate a result
### - Re-run for every row generated in final data set 
### - Used for advanced joining, filtering and evaluating data
### - Simple subquery is run independent of main query
### - Simple subquery is evaluated once
### - Correlated subquery is dependent on main query to execute
### - Correalted subquery is evaluated in loops once for each row generated by data set
### - Correalted subquery slows down performance

----

### - E.g. Which match stages tend to have a higher than average number of goals scored?
### - WHERE statement is saying 'Return stages where values in subquery are higher than average


SELECT   
	-- Select the stage and average goals from s  
	s.stage,  
	ROUND(s.avg_goals,2) AS avg_goal,  
    -- Select the overall average for 2012/2013  
	(SELECT AVG(home_goal + away_goal) FROM match 
  WHERE season = '2012/2013') AS overall_avg  
FROM   
	-- Select the stage and average goals in 2012/2013 from match  
	(SELECT  
         stage,  
         AVG(home_goal + away_goal) AS avg_goals  
     FROM match  
     WHERE season = '2012/2013'  
     GROUP BY stage) AS s  
WHERE   
	-- Filter the main query using the subquery  
	s.avg_goals > (SELECT AVG(home_goal + away_goal)   
                   FROM match AS m 
                   WHERE s.stage > m.stage);  

----

### - E.g. What is the average number of goals scored in each country?
### - With JOIN
SELECT   
  c.name as country,   
  AVG (m.home_goal + m.away_goal) 
  AS avg_goals  
FROM country as c  
LEFT JOIN match as m  
ON c.id = m.country_id  
GROUP BY country ;

### - With Correlated Subquery
SELECT   
  c.name as country,   
  (SELECT
    AVG (home_goal + away_goal) 
    FROM match AS m
    WHERE m.country_id = c.id)
      AS avg_goals
FROM country as c ; 

----
### - E.g.Examine matches with scores that are extreme outliers for each country -- above 3 times the average score

SELECT   
	-- Select country ID, date, home, and away goals from match  
	main.country_id,  
    main.date,  
    main.home_goal,   
    main.away_goal  
FROM match AS main  
WHERE   
	-- Filter the main query by the subquery  
	(home_goal + away_goal) >   
        (SELECT AVG((sub.home_goal + sub.away_goal) * 3)  
         FROM match AS sub  
         -- Join the main query to the subquery in WHERE  
         WHERE main.country_id = sub.country_id);  

----
### - E.g. What was the highest scoring match for each country, in each season

SELECT   
	-- Select country ID, date, home, and away goals from match  
	main.country_id,  
    main.date,  
    main.home_goal,  
    main.away_goal  
FROM match AS main  
WHERE   
	-- Filter for matches with the highest number of goals scored  
	(home_goal + away_goal) =  
        (SELECT MAX(sub.home_goal + sub.away_goal)  
         FROM match AS sub  
         WHERE main.country_id = sub.country_id  
               AND main.season = sub.season);

#**NESTED SUBQUERIES**
---
### - Subquery nested inside another subquery
### - Can be correlated, uncorrelated or combination
### - Can reference information from outer subquery or main query

----
### - E.g. What is each countries average goal scored in 2011/2012 season

SELECT   
  c.name as country,   
  (SELECT AVG(home_goal + away_goal)  
  FROM match as m  
  WHERE m.country_id = c.id  -- Cottelates with main query  
    AND id IN (  
        SELECT id -- Begin inner subquery  
        FROM match  
        WHERE season = '2011/2012')) AS avg_goals  
FROM country as C;

----
### - E.g. Create a nested subquery to examine the highest total number of goals in each season, overall, and during July across all seasons

SELECT  
	-- Select the season and max goals scored in a match  
	season,  
    MAX (home_goal+ away_goal) AS max_goals,  
    -- Select the overall max goals scored in a match  
   (SELECT MAX (home_goal + away_goal) FROM match) AS overall_max_goals,  
   -- Select the max number of goals scored in any match in July  
   (SELECT MAX (home_goal + away_goal)   
    FROM match  
    WHERE id IN (  
          SELECT id FROM match WHERE EXTRACT(MONTH FROM date) = 07)) AS   july_max_goals    
FROM match  
GROUP BY season;  
----
##**NEST SUBQUERY IN FROM**
----
### - E.g. What's the average number of matches per season where a team scored 5 or more goals? How does this differ by country

SELECT  
	c.name AS country,  
    -- Calculate the average matches per season  
    AVG(outer_s.matches) AS avg_seasonal_high_scores  
FROM country AS c  
-- Left join outer_s to country  
LEFT JOIN (  
  SELECT country_id, season,  
         COUNT(id) AS matches  
  FROM (  
    SELECT country_id, season, id  
	FROM match  
	WHERE home_goal >= 5 OR away_goal >= 5) AS inner_s  
  -- Close parentheses and alias the subquery  
  GROUP BY country_id, season) AS outer_s  
ON c.id = outer_s.country_id  
GROUP BY country;

#**COMMON TABLE EXPRESSIONS (CTE)**
----
### - Improve readability and accesibility
### - Special type of subquery table declared ahead of main query
### - Instead of wrapping subquery, name it using WITH statement and reference using FROM statement
### - List multiple CTEs with comma in between and no comma after the last
### - CTE run only once and stored in memory - improves performance
### - Improves organising long queries
### - **CTE can reference information from earlier CTEs**
### - **CTE can reference itself (SELF JOIN) in a recursice CTE**


-----
### - E.g. 

WITH s AS (  
  SELECT country_id, id  
  FROM match   
  WHERE (home_goal + away_goal) >= 10  
)  

SELECT  
  c.name AS country,  
  COUNT (s.id) AS matches  
FROM country as c  
INNER JOIN s  
ON c.id = s.country_id    
GROUP BY country ;  

----
### - E.g. Generat a list of countries and the number of matches in each country with more than 10 total goals
### - Old ex. 
SELECT  
  c.name AS country,  
  COUNT(sub.id) AS matches  
FROM country AS c  
INNER JOIN (  
  SELECT country_id, id   
  FROM match  
  WHERE (home_goal + away_goal) >= 10) AS sub  
ON c.id = sub.country_id  
GROUP BY country;  

### - Declare CTE method
-- Set up your CTE  
WITH match_list AS (  
    SELECT   
  		country_id,   
  		id  
    FROM match  
    WHERE (home_goal + away_goal) >= 10)  
-- Select league and count of matches from the CTE    
SELECT  
    l.name AS league,  
    COUNT(match_list.id) AS matches  
FROM league AS l  
-- Join the CTE to the league table  
LEFT JOIN match_list ON l.id = match_list.country_id  
GROUP BY l.name;  

----
### - E.g.
-- Set up your CTE  
WITH match_list AS (  
  -- Select the league, date, home, and away goals  
    SELECT   
  		l.name AS league,   
     	m.date,   
  		m.home_goal,   
  		m.away_goal,  
       (m.home_goal + m.away_goal) AS total_goals  
    FROM match AS m  
    LEFT JOIN league as l ON m.country_id = l.id)  
-- Select the league, date, home, and away goals from the CTE  
SELECT league, date, home_goal, away_goal  
FROM match_list  
-- Filter by total goals  
WHERE total_goals >= 10;  
----
### - E.g.
-- Set up your CTE  
WITH match_list AS (    
    SELECT   
  		country_id,   
  	   (home_goal + away_goal) AS goals  
    FROM match  
    -- Create a list of match IDs to filter data in the CTE  
    WHERE id IN (  
       SELECT id  
       FROM match  
       WHERE season = '2013/2014' AND EXTRACT(MONTH FROM date) = 08))  
-- Select the league name and average of goals in the CTE  
SELECT    
	l.name,
    AVG(match_list.goals)  
FROM league AS l  
-- Join the CTE onto the league table  
LEFT JOIN match_list ON l.id = match_list.country_id  
GROUP BY l.name;

#**DECIDING ON TECHNIQUES TO USE**

### - Use cases overlap JOINS, SUBQUERIES and CTEs
### - Can be used interchangeably
### - BUT not identical
### - Depends on the db, field, and questions
### - Best technique allows to use / reuse and generate clear and accurate results

---

##**JOINS**
### - Combine 2+ tables
### - Simple operations / aggregation of tables already present in db
### - E.g. What is the total sales per employee?
----

##**CORRELATED SUBQUERY**
### - Match subqueries and tables or another subquery
### - Circumvent limits on JOIN - cannot join seperate columns in a table to a single column in another table
### - High processing time
### - E.g. Who does each employee report to in a company?

----

##**MULTIPLE / NESTED SUBQUERIES**
### - Multi-step transformations
### - Breaking down steps allows better accuracy, readability and reproducibility
### - E.g. What is the average deal size closed by each sales rep in a quarter? 

----

##**COMMON TABLE EXPRESSIONS (CTEs)**
### - Orgnise subqueries sequentialy by declaring at beginning 
### - CTEs are processed one at a time before main query
### - Can reference information from CTE as alternative to nested subqueries
### - How did the marketing, sales, growth and engineering teams perform on key metrics?

#**WINDOW FUNCTIONS - WORKING WITH AGGREGATE FUNCTIONS**
### - Must GROUP BY non-aggregate value for every single aggregate function
### - Cannot compare aggregate vlue to non-aggregate data

### - WINDOW FUNCTIONS can perform calculations on an already generated result set (a window)
### - Can use WINDOW FUNCTIONS for aggregate calculations without GROUP BY
### - Similar to subqueries in SELECT
### - Can use to calculate running totals, rankings and moving averages
### - Processed after every part of query except ORDER BY
### - Uses infor from result set vs from db
### - Not available in SQLite


----
### - E.g. How many goals were scored in each match in 2011/2012, and how did that compare to average 

### - Subquery in SELECT method. Selects 2 columns from match table and uses subquery in SELECT to pass overall average w/o aggregting results
SELECT   
  date,   
  (home_goal + away_goal) AS goals,   
  (SELECT AVG (home_goal + away_goal)  
    FROM match  
    WHERE season = '2011/2012') AS overall_avg  
FROM match  
WHERE season = '2011/2012' ;

##**Window Function using OVER clause method**
### - Passes aggregate value over this existing result set
SELECT  
  date,   
  (home_goal + away-goal) AS goals,   
  AVG (home_goal + away_goal) OVER () AS overall_avg  
FROM match  
WHERE season = '2011/2012' ;

----
##**Generate a RANK** 
### - Ranks dataset from highest to lowest or lowest to highest based on specified column
### - Specify column / calculation to calculate rank in ORDER BY caluse inside OVER caluse
### - E.g. What is the rank of matches based on number of goals scored
SELECT   
  date,   
  (home_goal + away_goal) AS goals,   
  RANK () OVER (ORDER BY home_goal + away_goal) AS goals_rank  
FROM match  
WHERE season = '2011/2012 ;

#**WINDOW PARTITIONS**
-----
##**OVER and PARTITION BY**
### - Calculate sepearte values for different categories established in a partition
### - Calculate different calculations in same column insead of having to calulate them in different columns
----
### - Syntax
AVG(home_goal) OVER (PARTITION BY season)

----

### - Previous E.g. How many goals were scored in each match, and how did that compare to average
SELECT  
  date,   
  (home_goal + away_goal) AS goals,   
  AVG (home_goal + away_goal) OVER () AS overall_avg  
FROM match ;


### - E.g. How many goals were scored in each match, and how did that compare to season's average 
SELECT  
  date,   
  (home_goal + away_goal) AS goals,   
  AVG (home_goal + away_goal) OVER (PARTITION BY season) AS season_avg  
FROM match ;

----
##**PARTITION BY multiple columns**
### - Can partition data by 1 or more column
### - Can partition anyn kinf of window function
----
### - E.g. 
SELECT  
 c.name,  
 m.season,  
 (home_goal + away_goal) AS goals,  
 AVG (home_goal + away_goal)  
  OVER (PARTITION BY m.season, c.name) AS season_ctry_avg  
FROM country as c  
LEFT JOIN match as m  
ON c.id = m.country_id ;    
----
### - E.g. Calculate information to partition data
SELECT 
	date,
	season,
    home_goal,
    away_goal,
    CASE WHEN hometeam_id = 8673 THEN 'home' 
         ELSE 'away' END AS warsaw_location,
    -- Calculate the average goals scored partitioned by season
    AVG(home_goal) OVER(PARTITION BY season) AS season_homeavg,
    AVG(away_goal) OVER(PARTITION BY season) AS season_awayavg
FROM match
-- Filter the data set for Legia Warszawa matches only
WHERE 
	hometeam_id = 8673 
    OR awayteam_id = 8673
ORDER BY (home_goal + away_goal) DESC;

#**SLIDING WINDOWS**
### - Information changes with each subsequent row
### - Performs calculations relative to current row
### - Used to calculate running totls, sums, averages, etc
### - Can be partitioned by 1 or more columns
### - Contain specific functions inside OVER clause to specify what to calculate
----
## - SYNTAX : ROWS BETWEEN <start> AND <finish>
## - PRECEDING - specify no. of rows before the row
## - FOLLOWING - specify no. of rows after the row
## - UNBOUNDED PRECEDING - specify all rows before
## - UNBOUNDED FOLLOWING - specify all rows after
## - CURRENT ROW - stop calculaton at current row

----
### - E.g. Running total goals of Manchester City home games in 2011/2012 ordered by date
--Manchester City Home Games  
SELECT   
  date,   
  home_goal,  
  away_goal,   
  SUM (home_goal) 
    OVER (ORDER BY date ROWS BETWEEN   
    UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total  
FROM match  
WHERE hometeam_id = 8456 AND season = '2011/2012';  

----

#**SLIDING WINDOW FRAME**
### - Calculate with a more limited frame
----
### - E.g. Total of current and previous goals of Manchester City home games in 2011/2012 ordered by date
--Manchester City Home Games  
SELECT   
  date,   
  home_goal,  
  away_goal,   
  SUM (home_goal) 
    OVER (ORDER BY date ROWS BETWEEN   
    1 PRECEDING AND CURRENT ROW) AS last2    
FROM match  
WHERE hometeam_id = 8456 AND season = '2011/2012';  
----
### - E.g. Calculate the running total of goals scored by the FC Utrecht when they were the home team during the 2011/2012 season
SELECT 
	date,
	home_goal,
	away_goal,
    -- Create a running total and running average of home goals
    SUM(home_goal) OVER (ORDER BY date 
         ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_total,
    AVG(home_goal) over (ORDER BY date 
         ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS running_avg
FROM match
WHERE 
	hometeam_id = 9908 
	AND season = '2011/2012';

----
### - E.g. Modify previous exercise by sorting the data set in reverse order and calculating a backward running total from the CURRENT ROW to the end of the data set (earliest record)
SELECT 
	-- Select the date, home goal, and away goals
    date,
    home_goal,
    away_goal,
    -- Create a running total and running average of home goals
    SUM(home_goal) OVER(ORDER BY date DESC
         ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING) AS running_total,
    AVG(home_goal) OVER(ORDER BY date DESC
         ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING) AS running_avg
FROM match
WHERE 
	awayteam_id = 9908 
    AND season = '2011/2012';

#**EXCERISE - Generate a list of matches in which Manchester United was defeated during the 2014/2015 English Premier League season**

----

SELECT 
	m.id, 
    t.team_long_name,
    -- Identify matches as home/away wins or ties
	CASE  WHEN m.home_goal > m.away_goal THEN 'MU Win'
		    WHEN m.home_goal < m.away_goal THEN 'MU Loss'
        ELSE 'Tie' END AS outcome
FROM match AS m
-- Left join team on the home team ID and team API id
LEFT JOIN team AS t 
ON m.hometeam_id = t.team_api_id
WHERE 
	-- Filter for 2014/2015 and Manchester United as the home team
	m.season = '2014/2015'
	AND t.team_long_name = 'Manchester United';

----

SELECT 
	m.id, 
    t.team_long_name,
    -- Identify matches as home/away wins or ties
	CASE WHEN m.home_goal < m.away_goal THEN 'MU Loss'
		   WHEN m.home_goal > m.away_goal THEN 'MU Win'
       ELSE 'Tie' END AS outcome
-- Join team table to the match table
FROM match AS m
LEFT JOIN team AS t 
ON m.awayteam_id = t.team_api_id
WHERE 
	-- Filter for 2014/2015 and Manchester United as the away team
	m.season = '2014/2015'
	AND t.team_long_name = 'Manchester United';

----

-- Set up the home team CTE
WITH home AS (
  SELECT m.id, t.team_long_name,
	  CASE WHEN m.home_goal > m.away_goal THEN 'MU Win'
		   WHEN m.home_goal < m.away_goal THEN 'MU Loss' 
  		   ELSE 'Tie' END AS outcome
  FROM match AS m
  LEFT JOIN team AS t ON m.hometeam_id = t.team_api_id),
-- Set up the away team CTE
away AS (
  SELECT m.id, t.team_long_name,
	  CASE WHEN m.home_goal > m.away_goal THEN 'MU Loss'
		   WHEN m.home_goal < m.away_goal THEN 'MU Win' 
  		   ELSE 'Tie' END AS outcome
  FROM match AS m
  LEFT JOIN team AS t ON m.awayteam_id = t.team_api_id)
-- Select team names, the date and goals
SELECT DISTINCT
    m.date,
    home.team_long_name AS home_team,
    away.team_long_name AS away_team,
    m.home_goal, m.away_goal
-- Join the CTEs onto the match table
FROM match AS m
LEFT JOIN home ON m.id = home.id
LEFT JOIN away ON m.id = away.id
WHERE m.season = '2014/2015'
      AND (home.team_long_name = 'Manchester United' 
           OR away.team_long_name = 'Manchester United');

----

-- Set up the home team CTE
WITH home AS (
  SELECT m.id, t.team_long_name,
	  CASE WHEN m.home_goal > m.away_goal THEN 'MU Win'
		   WHEN m.home_goal < m.away_goal THEN 'MU Loss' 
  		   ELSE 'Tie' END AS outcome
  FROM match AS m
  LEFT JOIN team AS t ON m.hometeam_id = t.team_api_id),
-- Set up the away team CTE
away AS (
  SELECT m.id, t.team_long_name,
	  CASE WHEN m.home_goal > m.away_goal THEN 'MU Loss'
		   WHEN m.home_goal < m.away_goal THEN 'MU Win' 
  		   ELSE 'Tie' END AS outcome
  FROM match AS m
  LEFT JOIN team AS t ON m.awayteam_id = t.team_api_id)
-- Select columns and and rank the matches by goal difference
SELECT DISTINCT
    m.date,
    home.team_long_name AS home_team,
    away.team_long_name AS away_team,
    m.home_goal, m.away_goal,
    RANK () OVER (ORDER BY ABS(home_goal - away_goal) DESC ) AS match_rank
-- Join the CTEs onto the match table
FROM match AS m
LEFT JOIN home ON m.id = home.id
LEFT JOIN away ON m.id = away.id
WHERE m.season = '2014/2015'
      AND ((home.team_long_name = 'Manchester United' AND home.outcome = 'MU Loss')
      OR (away.team_long_name = 'Manchester United' AND away.outcome = 'MU Loss'));

#**POSTGRESQL SUMMARY STATS AND WINDOW FUNCTIONS**
1. Introduction to window functions
2. Fetching, ranking and paging
3. Aggregate window functions and frames
4. Beyond window functions

* Window functions perform an operation across a set of rows that are somehow releted to the current row (which is the row the window function is currently operating on ). 

* Similar to GROUP BY aggregate functions, but instead of rows being grouped into a single row, all rows remain in the output. 

* Window functions take as input the rows of the table being queried. 

##Uses
* Fetch values from preceding or following rows
 
* Assign ordinal ranks to rows based on  their values' positions ina  sorted list

* Running totals, moving averages


----
#**SUMMER OLYMPICS DATASET**

Each row represensts a medal awarded in the Summer Olympics games

Columns
* Year
* City
* Sport
* Discipline
* Athlete
* Country
* Gender
* Event
* Medal

#**INTRODUCTION TO WINDOW FUNCTIONS**
----
##**Assign Row Numbers**
SELECT
  year, event, country,
  ROW_NUMBER () OVER () AS row_n
FROM summer_medals
WHERE 
  medal = 'Gold';

* FUNCTION_NAME () OVER (...)  
...
  * ORDER_BY
  * PARTITION_BY
  * and ROWS / RANGE PRECEDING / FOLLOWING / UNBOUNDED

#**ORDER BY**
##E.g. Ordering by year in descending order in RoW_NUMBER's OVER clause will assign 1 to the most recent year's row

SELECT
  Year, Event, Country,
  ROW_NUMBER () OVER (ORDER BY Year DESC) AS Row_N
FROM Summer_Medals
WHERE 
  Medal = 'Gold';

##Ordering by multiple columns

SELECT
  Year, Event, Country,
  ROW_NUMBER () OVER (ORDER BY Year DESC, Event ASC) AS Row_N
FROM Summer_Medals
WHERE 
  Medal = 'Gold';

##Order inside and outside OVER
##E.g. Ordering by year and event in descending order in RoW_NUMBER's OVER clause will assign 1 to the most recent year and event's row | Ouside ORDER BY orders by country and the assigned row
SELECT
  Year, Event, Country,
  ROW_NUMBER () OVER (ORDER BY Year DESC, Event ASC) AS Row_N
FROM Summer_Medals
WHERE 
  Medal = 'Gold'
ORDER BY Country ASC, Row_N ASC ;

#**LAG**
##LAG(column, n) OVER (...) returns column's value at the row n rows before the current row (passing 1 to n returns previous row's value)

##E.g. Reigning Champion (someone who has won in previous and current year)
##Previous and current year champion needs to be in the same row (in 2 different columns)

WITH Discuss_Gold AS (
  SELECT
    Year, Country AS Champion
  FROM Summer_Medals
  WHERE
    Year IN (1996, 2000, 2004, 2008, 2012)
    AND Gender = 'Men' AND Medal = 'Gold'
    AND Event = 'Discuss Throw')

SELECT 
  Year, Champion,
  LAG (Champion, 1) OVER
  (ORDER BY Year ASC) AS Last_Champion
FROM Discuss_Gold

##E.g. Assign a number to each year in which Summer Olympic games were held so that row with the most recent years have lower row numbers
SELECT
  Year,
  -- Assign the lowest numbers to the most recent years
  ROW_NUMBER () OVER (ORDER BY Year DESC) AS Row_N
FROM (
  SELECT DISTINCT Year
  FROM Summer_Medals
) AS Years
ORDER BY Year;

##E.g. Row numbering can also be used for ranking. For example, numbering rows and ordering by the count of medals each athlete earned in the OVER clause will assign 1 to the highest-earning medalist, 2 to the second highest-earning medalist, and so on.

WITH Athlete_Medals AS (
  SELECT
    -- Count the number of medals each athlete has earned
    Athlete,
    COUNT(*) AS Medals
  FROM Summer_Medals
  GROUP BY Athlete)

SELECT
  -- Number each athlete by how many medals they've earned
  Athlete,
  ROW_NUMBER () OVER (ORDER BY Medals DESC) AS Row_N
FROM Athlete_Medals
ORDER BY Medals DESC;


##E.g. Reigning weightlifting champions - A reigning champion is a champion who's won both the previous and current years' competitions. To determine if a champion is reigning, the previous and current years' results need to be in the same row, in two different columns.

WITH Weightlifting_Gold AS (
  SELECT
    -- Return each year's champions' countries
    Year,
    Country AS champion
  FROM Summer_Medals
  WHERE
    Discipline = 'Weightlifting' AND
    Event = '69KG' AND
    Gender = 'Men' AND
    Medal = 'Gold')

SELECT
  Year, Champion,
  -- Fetch the previous year's champion
  LAG (Champion, 1) OVER
    (ORDER BY year ASC) AS Last_Champion
FROM Weightlifting_Gold
ORDER BY Year ASC;

#**PARTITION BY**
##Splits table into partitions based on a column's unique values
##Results are not rolled into one column
##Partitions are operated on seperately by the window function
##Partition by multiple columns


WITH Discuss_Gold AS (
  SELECT
    Year, Country AS Champion
  FROM Summer_Medals
  WHERE
    Year IN (2004, 2008, 2012)
    AND Medal = 'Gold'
    AND Event IN ('Discuss Throw', 'Triple Jump')
    AND Gender = 'Men')

SELECT 
  Year, Champion,
  LAG (Champion, 1) OVER
  (PARTITION BY event ORDER BY Event ASC, Year ASC) AS Last_Champion
FROM Discuss_Gold
ORDER BY Event ASC, Year ASC ;

##E.g. Reigning champions by gender. You've already fetched the previous year's champion for one event. However, if you have multiple events, genders, or other metrics as columns, you'll need to split your table into partitions to avoid having a champion from one event or gender appear as the previous champion of another event or gender.

WITH Athletics_Gold AS (
  SELECT DISTINCT
    Gender, Year, Event, Country
  FROM Summer_Medals
  WHERE
    Year >= 2000 AND
    Discipline = 'Athletics' AND
    Event IN ('100M', '10000M') AND
    Medal = 'Gold')

SELECT
  Gender, Year, Event,
  Country AS Champion,
  -- Fetch the previous year's champion by gender and event
  LAG (Country, 1) OVER (PARTITION BY Gender, Event
            ORDER BY Year ASC) AS Last_Champion
FROM Athletics_Gold
ORDER BY Event ASC, Gender ASC, Year ASC;

#**FETCHING**
____

##**Relative**
* LAG (column, n) returns column's value at the row n rows before the current row

* LEAD (column, n) returns column's value at the row n rows after the current row

##**Absolute**
* FIRST_VALUE |(column) returns the first value in the table or partition

* LAST_VALUE |(column) returns the last value in the table or partition

###E.g. 
WITH Hosts AS (
  SELECT DISTINCT Year, City
  FROM Summer_Medals)

SELECT 
  Year, City, 
  LEAD (City, 1) OVER (ORDER BY Year ASC)
  AS Next_City
  LEAD (City, 20 OVER (ORDER BY Year ASC)
  AS After_Next_City
FROM Hosts
ORDER BY YEAR ASC ;

###E.g. 
WITH Hosts AS (
  SELECT DISTINCT Year, City
  FROM Summer_Medals)

SELECT 
  Year, City, 
  FIRST_VALUE (City) OVER (ORDER BY Year ASC) AS First_City, 
  LAST_VALUE (City) OVER (
   ORDER BY Year ASC
   RANGE BETWEEN 
      UNBOUNDED PRECEDING AND
      UNBOUNDED FOLLOWING 
  ) AS Last_City
FROM Hosts
ORDER BY YEAR ASC ;

###E.g. 
WITH All_Male_Medalists AS (
  SELECT DISTINCT
    Athlete
  FROM Summer_Medals
  WHERE Medal = 'Gold'
    AND Gender = 'Men')

SELECT
  -- Fetch all athletes and the first athlete alphabetically
  Athlete,
  FIRST_VALUE (Athlete) OVER (
    ORDER BY Athlete ASC
  ) AS First_Athlete
FROM All_Male_Medalists;

###E.g. 
WITH Discus_Medalists AS (
  SELECT DISTINCT
    Year,
    Athlete
  FROM Summer_Medals
  WHERE Medal = 'Gold'
    AND Event = 'Discus Throw'
    AND Gender = 'Women'
    AND Year >= 2000)

SELECT
  -- For each year, fetch the current and future medalists
  Year, Athlete,
  
  LEAD (Athlete, 3) OVER (ORDER BY Year ASC) AS Future_Champion
FROM Discus_Medalists
ORDER BY Year ASC;

###E.g. 
WITH Hosts AS (
  SELECT DISTINCT Year, City
    FROM Summer_Medals)

SELECT
  Year,
  City,
  -- Get the last city in which the Olympic games were held
  LAST_VALUE (City) OVER (
   ORDER BY Year ASC
   RANGE BETWEEN
     UNBOUNDED PRECEDING AND
     UNBOUNDED FOLLOWING
  ) AS Last_City
FROM Hosts
ORDER BY Year ASC;

------


###Note
By default, a window starts at the beginning of the table or partition and ends at the current row. Without the RANGE BETWEEN clause, LAST_VALUE will get the value of the current row, so Last_City will be the same as City. The RANGE BETWEEN clause extends the window to the end of the table or partition so that the actual last value will be fetched.


#**Partitioning with LEAD**
_____
So far, you've seen the functions used over the entire table, but what happens if you want to partition? These two tables fetch the current and next champions of the Discus Throw and Triple Jump events, but the left table doesn't partition by event, while the right table does. Since the left table isn't partitioned, Discus Throw's last row will fetch Triple Jump's first champion, which isn't right. Partitioning by event will correctly set Discus Throw's last row's next champion to be null, since Discus Throw's partition ends there.

#**Partitioning with FIRST_VALUE**
_____
Similarly, in the left table, the table isn't partitioned by event, so LTU will be Triple Jump's First_Champion even though it's in Discus Throw. The right table IS partitioned by event, so SWE will correctly be set as Triple Jump's First_Champion. Partitioning with LAST_VALUE works much the same way.

#**RANKING**
##**ROW_NUMBER() - Always assigns unique numbers even if 2 row's values are same**
##**RANK() - Assigns same no. to rows with identical values, skipping over next numbers**
##**DENSE_RANK() -  Also assigns same no. to rows with identical values, but does not skip over next numbers**
-----
##**Note**
* DENSE_RANK () will have last rank is count of unique values
* Note - ROW_NUMBER() and RANK() will have same last rank - no. of rows
* Use PARTITION_BY() the column that splits rows into correct groups

----
###E.g. 
WITH Athlete_Medals AS (
  SELECT
    Athlete,
    COUNT(*) AS Medals
  FROM Summer_Medals
  GROUP BY Athlete)

SELECT
  Athlete,
  Medals,
  -- Rank athletes by the medals they've won
  RANK () OVER (ORDER BY Medals DESC) AS Rank_N
FROM Athlete_Medals
ORDER BY Medals DESC;

###E.g. 
WITH Athlete_Medals AS (
  SELECT
    Country, Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country IN ('JPN', 'KOR')
    AND Year >= 2000
  GROUP BY Country, Athlete
  HAVING COUNT(*) > 1)

SELECT
  Country,
  -- Rank athletes in each country by the medals they've won
  Athlete ,
  DENSE_RANK () OVER (PARTITION BY Country
                ORDER BY Medals DESC) AS Rank_N
FROM Athlete_Medals
ORDER BY Country ASC, RANK_N ASC;

#**PAGING**
* Split data into appox equal chunks
* APIs return data in pages to reduce traffic
* Sepearte data into quartiles or thirds to judge performance
* label % of data
----
##**NTILE (n)**
* n = no. of pages or %

-----
###E.g.
WITH Events AS (
  SELECT DISTINCT Event
  FROM Summer_Medals)
  
SELECT
  --- Split up the distinct events into 111 unique groups
  Event, NTILE(111)
  OVER (ORDER BY Event ASC) AS Page
FROM Events
ORDER BY Event ASC;

###E.g. 
WITH Athlete_Medals AS (
  SELECT Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  GROUP BY Athlete
  HAVING COUNT(*) > 1),
  
  Thirds AS (
  SELECT
    Athlete,
    Medals,
    NTILE(3) OVER (ORDER BY Medals DESC) AS Third
  FROM Athlete_Medals)
  
SELECT
  -- Get the average medals earned in each third
  Third,
  AVG(Medals) AS Avg_Medals
FROM Thirds
GROUP BY Third
ORDER BY Third ASC;

#**AGGREGATE WINDOW FUNCTIONS**
* MAX
* SUM
* COUNT
* MIN
* AVG
* Can partition 
____

###E.g. 
WITH Athlete_Medals AS (
  SELECT
    Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country = 'USA' AND Medal = 'Gold'
    AND Year >= 2000
  GROUP BY Athlete)

SELECT
  -- Calculate the running total of athlete medals
  Athlete,
  Medals,
  SUM (Medals) OVER (ORDER BY Athlete ASC) AS Max_Medals
FROM Athlete_Medals
ORDER BY Athlete ASC;


###E.g. 
WITH Country_Medals AS (
  SELECT
    Year, Country, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country IN ('CHN', 'KOR', 'JPN')
    AND Medal = 'Gold' AND Year >= 2000
  GROUP BY Year, Country)

SELECT
  -- Return the max medals earned so far per country
  Year,
  Country,
  Medals,
  MAX (Medals) OVER (PARTITION BY Country
                ORDER BY Year ASC) AS Max_Medals
FROM Country_Medals
ORDER BY Country ASC, Year ASC;


###E.g. 
WITH France_Medals AS (
  SELECT
    Year, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country = 'FRA'
    AND Medal = 'Gold' AND Year >= 2000
  GROUP BY Year)

SELECT
  Year,
  Medals,
  MIN (Medals) OVER (ORDER BY Year ASC) AS Min_Medals
FROM France_Medals
ORDER BY Year ASC;

#**FRAMES**
* Frame: RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
* Without Frame: LAST_VALUE returns last row (from begining to current row)
* With Frame: Extends the frame from beginning to end of table

----

##**DEFINE FRAME**
##**ROW BETWEEN [START] AND [FINISH]: treats duplicates in OVER's ORDER BY clause as multiple entities**

##**RANGE BETWEEN [START] AND [FINISH]: treats duplicates in OVER's ORDER BY clause as single entity**

* n PRECEDING: n rows before current row 
* CURRENT ROW: the current row
* n FOLLOWING: n rows after current row
* ROWS BWTWEEN 3 PRECEDING AND CURRENT ROW: Frame is 4 rows
* ROWS BWTWEEN 1 PRECEDING AND 1 FOLLOWING: Frame is 3 rows
* ROWS BWTWEEN 5 PRECEDING AND 1 PRECEDING: Frame is 5 rows

###E.g. 
WITH Scandinavian_Medals AS (
  SELECT
    Year, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country IN ('DEN', 'NOR', 'FIN', 'SWE', 'ISL')
    AND Medal = 'Gold'
  GROUP BY Year)

SELECT
  -- Select each year's medals
  Year,
  Medals,
  -- Get the max of the current and next years'  medals
  MAX (Medals) OVER (ORDER BY Year ASC
             RANGE BETWEEN CURRENT ROW 
             AND 1 FOLLOWING) AS Max_Medals
FROM Scandinavian_Medals
ORDER BY Year ASC;


###E.g. 
WITH Chinese_Medals AS (
  SELECT
    Athlete, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country = 'CHN' AND Medal = 'Gold'
    AND Year >= 2000
  GROUP BY Athlete)

SELECT
  -- Select the athletes and the medals they've earned
  Athlete,
  Medals,
  -- Get the max of the last two and current rows' medals 
  MAX (Medals) OVER (ORDER BY Athlete ASC
            RANGE BETWEEN 2 PRECEDING 
            AND CURRENT ROW ) AS Max_Medals
FROM Chinese_Medals
ORDER BY Athlete ASC;

#**MOVING AVERAGES AND TOTALS**

##**ROW BETWEEN [START] AND [FINISH]: treats duplicates in OVER's ORDER BY clause as multiple entities**

##**RANGE BETWEEN [START] AND [FINISH]: treats duplicates in OVER's ORDER BY clause as single entity**

* Define with Frame Windows
* Moving Average (MA): Average of last n periods
* Moving Total (MT): Sum of last n periods


###E.g. 
WITH Russian_Medals AS (
  SELECT
    Year, COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE
    Country = 'RUS'
    AND Medal = 'Gold'
    AND Year >= 1980
  GROUP BY Year)

SELECT
  Year, Medals,
  --- Calculate the 3-year moving average of medals earned
  AVG(Medals) OVER
    (ORDER BY Year ASC
     ROWS BETWEEN
     2 PRECEDING AND CURRENT ROW) AS Medals_MA
FROM Russian_Medals
ORDER BY Year ASC;

###E.g.

#**PIVOTING**
* Transforms tables by column values
* Easier to scan if chronologically reshaped
----
##**CROSSTAB**
-- Create the correct extention to enable CROSSTAB
CREATE EXTENSION IF NOT EXISTS tablefunc;

SELECT * FROM CROSSTAB($$
  SELECT
    Gender, Year, Country
  FROM Summer_Medals
  WHERE
    Year IN (2008, 2012)
    AND Medal = 'Gold'
    AND Event = 'Pole Vault'
  ORDER By Gender ASC, Year ASC;
-- Fill in the correct column names for the pivoted table
$$) AS ct (Gender VARCHAR,
           "2008" VARCHAR,
           "2012" VARCHAR)

ORDER BY Gender ASC;

##**PIVOTING WITH RANKING**
CREATE EXTENSION IF NOT EXISTS tablefunc;

SELECT * FROM CROSSTAB($$
  WITH Country_Awards AS (
    SELECT
      Country,
      Year,
      COUNT(*) AS Awards
    FROM Summer_Medals
    WHERE
      Country IN ('FRA', 'GBR', 'GER')
      AND Year IN (2004, 2008, 2012)
      AND Medal = 'Gold'
    GROUP BY Country, Year)

  SELECT
    Country,
    Year,
    RANK() OVER
      (PARTITION BY Year
       ORDER BY Awards DESC) :: INTEGER AS rank
  FROM Country_Awards
  ORDER BY Country ASC, Year ASC;
-- Fill in the correct column names for the pivoted table
$$) AS ct (Country VARCHAR,
           "2004" INTEGER,
           "2008" INTEGER,
           "2012" INTEGER)

Order by Country ASC;

#**ROLLUP and CUBE**
* Calculate group level and grand totals

##**ROLLUP**
* GROUP BY subclause that includes extra rows for group-level aggregations
* ROLLUP all GROUP BY olumns generates additional row with the grand total
* Hierarchical - order of columns in ROLLUP clause affects the output
* Group-level totals contains nulls - the row with all nulls is the grand total

##**CUBE**
* Non-hierarchical ROLLUP

##**ROLLUP vs CUBE**
* Use ROLLUP with hierarchical data (date parts) and do not want all possible group-level aggregations

* Use CUBE for all possible group-level aggregations

##E.g. 
-- Count the gold medals per country and gender
SELECT
  Country,
  Gender,
  COUNT(*) AS Gold_Awards
FROM Summer_Medals
WHERE
  Year = 2004
  AND Medal = 'Gold'
  AND Country IN ('DEN', 'NOR', 'SWE')
-- Generate Country-level subtotals
GROUP BY Country, ROLLUP(Gender)
ORDER BY Country ASC, Gender ASC;

##E.g.
-- Count the medals per gender and medal type
SELECT
  Gender,
  Medal,
  COUNT(*) AS Awards
FROM Summer_Medals
WHERE
  Year = 2012
  AND Country = 'RUS'
-- Get all possible group-level subtotals
GROUP BY CUBE(Gender, Medal)
ORDER BY Gender ASC, Medal ASC;

#**USEFUL WINDOW FUNCTIONS**

##**COALESCE**

* Takes list of values and returns the first non-null value, going from left to right

* COALESCE (null, null, 1, null, 2) ? 1

* Useful whrn using SQL operations that retun null such as:
  * ROLLUP and CUBE
  * Pivoting - when some rows don't have any corresponding values
  * Positional operations LAG and LEAD - which always return null for 1st row

##**STRING_AGG
* Compress data in RANK in 1 row
* STRING_AGG (column, seperator) takes all values in column and concatenates with seperator between each value



##E.g. 
SELECT
  -- Replace the nulls in the columns with meaningful text
  COALESCE(Country, 'All countries') AS Country,
  COALESCE(Gender, 'All genders') AS Gender,
  COUNT(*) AS Awards
FROM Summer_Medals
WHERE
  Year = 2004
  AND Medal = 'Gold'
  AND Country IN ('DEN', 'NOR', 'SWE')
GROUP BY ROLLUP(Country, Gender)
ORDER BY Country ASC, Gender ASC;

##E.g.
WITH Country_Medals AS (
  SELECT
    Country,
    COUNT(*) AS Medals
  FROM Summer_Medals
  WHERE Year = 2000
    AND Medal = 'Gold'
  GROUP BY Country),

  Country_Ranks AS (
  SELECT
    Country,
    RANK() OVER (ORDER BY Medals DESC) AS Rank
  FROM Country_Medals
  ORDER BY Rank ASC)

-- Compress the countries column
SELECT STRING_AGG(Country, ', ')
FROM Country_Ranks
-- Select only the top three ranks
WHERE Rank <= 3;

#**FUNCTIONS FOR MANIPULATING DATA IN POSTGRESQL**

----


##**Query from schema**
SELECT   
  column_name  
  data_type
FROM INFORMATION_SCHEMA.COLUMNS  
  WHERE column_name IN ('xxx', 'yyy', 'zzz')  
  AND table_name = 'aaa'

----

##**COMMON DATA TYPES**
* Text
  * CHAR
  * VARCHAR
  * TEXT

* Numeric
  * INT
  * DECIMAL

* Date / Time
  * DATE
  * TIME
  * TIMESTAMP
  * INTERVAL

* Arrays

----
##E.g. 
Select all columns from the INFORMATION_SCHEMA.TABLES system database. Limit results that have a public table_schema.

 SELECT *   
 FROM INFORMATION_SCHEMA.TABLES  
 -- Filter by schema  
 WHERE table_schema = 'public';  

##E.g. 
Select all columns from the INFORMATION_SCHEMA.COLUMNS system database. Limit by table_name to actor

 -- Select all columns from the COLUMNS system database  
 SELECT *   
 FROM INFORMATION_SCHEMA.COLUMNS   
 WHERE table_name = 'actor';  

##E.g. 
Select the column name and data type from the INFORMATION_SCHEMA.COLUMNS system database. 
Limit results to only include the customer table.

-- Get the column name and data type  
SELECT  
 	column_name,   
    data_type  
-- From the system database information schema  
FROM INFORMATION_SCHEMA.COLUMNS   
-- For the customer table  
WHERE table_name = 'customer';

#**DATE AND TIME DATA TYPES**

* Timestamp ISO 8601 format: yyyy-mm-dd hh:mm:ss.microsecond
* Date: yyyy-mm-dd
* Time: hh:mm:ss.microsecond
* Interval: E.g. SELECT rental_date + INTERVAL '3 days' AS expected_return
* Postgresql default: Timestamp without time zone

#**ARRAY DATA TYPES**

* Array is a special type
* Can create multi-dimensional arrays
* Add square brackets to the end of the data type
* Insert with curly brackets

##E.g. Create simple table with 2 array columns
CREATE TABLE grades (  
  student_id INT,   
  email TEXT [ ] [ ], -- nested data to store email type and id   
  test_scores INT [ ]  -- array of integer values representing test score  
) ;  

##E.g. INSERT statements with ARRAYS
INSERT INTO grades  
VALUES (1,   
  '{{"work", "work1@email.com"}, {"other", "other1@email.com"}}',   
  '{92,85,96,88}');

----
##E.g. Accessing ARRAYs
* **ARRAYs work like other programmimg languages**

* **Postgresql ARRAY indexes start with 1 (not 0)**
* **Can also use inside WHERE clause as a filter**

SELECT  
  email [1] [1] AS type,  
  email [1] [2] AS address,  
  test_scores [1]    
FROM grades;    


SELECT   
  email [1] [1] AS type,  
  email [1] [2] AS address,  
  test_scores[1]    
FROM grades    
WHERE email [1][1] = 'work' ;

#**ARRAY functions and operators**

##Search ARRAY with ANY
* Match in any index regardless of position

* E.g. Query all records where email address contains 'other' in any value of the array

SELECT  
  email [2] [1] AS type,  
  email [2] [2] AS address,  
  test_scores [1]  
FROM grades  
WHERE 'other' = ANY (email) ;

##Search ARRAY with CONTAINS
* Alternative to ANY function

SELECT  
  email [2] [1] AS type,  
  email [2] [2] AS address,  
  test_scores [1]  
FROM grades  
WHERE email @> ARRAY ['other'] ;

#**ARITHMETIC OPERATIONS**


##Add / Substract date / time = integer
* SELECT date '2005-09-11' - date '2005-09-10' ; = 1 

##Add / Substract integer to date / time = date / time 
* SELECT date '2005-09-11' + INT '3' ; = '2005-09-14' 
* Implied precision is days

##Add / Substract timestamp to timestamp = interval
* SELECT date '2005-09-11 00:00:00' - date '2005-09-09 12:00:00'; = interval

##Calculate time periods with AGE
* Returns interval as result
* SELECT AGE(timestamp '2005-09-11 00:00:00', timestamp '2005-09-09 12:00:00');

##Date / time arithmetic using INTERVALS
* Multiply / Divide 
* SELECT timestamp '2019-05-01' + 21 * INTERVAL '1 day';+


##E.g. 
SELECT f.title, f.rental_duration,  
       -- Calculate the number of days rented  
       r.return_date - r.rental_date AS days_rented  
FROM film AS f  
     INNER JOIN inventory AS i ON f.film_id = i.film_id  
     INNER JOIN rental AS r ON i.inventory_id = r.inventory_id  
ORDER BY f.title;  


##E.g. 
SELECT f.title, f.rental_duration,  
	-- Calculate the number of days rented  
	AGE(r.return_date, r.rental_date) AS days_rented  
FROM film AS f  
	INNER JOIN inventory AS i ON f.film_id = i.film_id  
	INNER JOIN rental AS r ON i.inventory_id = r.inventory_id  
ORDER BY f.title;  

##E.g. 
SELECT  
    f.title,  
 	-- Convert the rental_duration to an interval  
    INTERVAL '1' day * f.rental_duration,  
 	-- Calculate the days rented as we did previously    
    r.return_date - r.rental_date AS days_rented    
FROM film AS f  
    INNER JOIN inventory AS i ON f.film_id = i.film_id  
    INNER JOIN rental AS r ON i.inventory_id = r.inventory_id  
-- Filter the query to exclude outstanding rentals  
WHERE r.return_date IS NOT NULL  
ORDER BY f.title;

#**FUNCTIONS FOR RETRIEVING CURRENT DATE / TIME**

* NOW () - retrieve current timestamp with timezone with microsecond precision

* CURRENT_TIMESTAMP (n) - same as NOW () but seconds rounded to n specified

* NOW ()::timestamp - retrieve current timestamp with microsecond precision

* CAST () - one datatype to another :: specific to postgresql

* CAST (NOW () as timestamp) - NOW is CASTED to TIMESTAMP

* CURRENT_DATE - current date without timestamp precision

* CURRENT_TIME - current time with precision with timezone

##E.g.  
SELECT   
	-- Select the current date  
	CURRENT_DATE,  
    -- CAST the result of the NOW() function to a date  
    CAST(NOW() AS date );

#**EXTRACTING AND TRANSFORMING DATE / TIME DATA**

* EXTRACT (field FROM source)
  * SELECT EXTRACT (quarter FROM timestamp '2005-01-24 05:12:00') AS quarter;

* DATE_PART ('field', source)
  * SELECT DATE_PART ('quarter', timestamp '2005-01-24 05:12:00') AS quarter; 

##E.g. 
SELECT  
  EXTRACT (quarter FROM payment_date) AS quarter,  
  EXTRACT (year FROM payment_date) AS year,  
  SUM (amount) AS total_payments  
FROM 
  payment  
GROUP BY 1, 2; --**NOTE - SPECIFY FIELDS IN SELECT CLAUSE BY NUMERIC REFERENCE**


* DATE_TRUNC ()
  * Truncate timestamp or interval dtypes at specified precision and return interval or timestamp

  * Truncate timestamp by year - SELECT DATE_TRUNC('year', TIMESTAMP '2005-05-21 12:00:00')

  * Truncate timestamp by month - SELECT DATE_TRUNC('month', TIMESTAMP '2005-05-21 12:00:00')

##E.g. 
-- Extract day of week from rental_date  
SELECT     
  EXTRACT(dow FROM rental_date) AS dayofweek,   
  -- Count the number of rentals  
  COUNT (*) as rentals   
FROM rental   
GROUP BY 1;  

##E.g. 
SELECT   
  DATE_TRUNC('day', rental_date) AS rental_day,  
  -- Count total number of rentals   
  COUNT(*) AS rentals   
FROM rental  
GROUP BY 1;  


##E.g. 
SELECT   
  -- Extract the day of week date part from the rental_date
  EXTRACT(dow FROM rental_date) AS dayofweek,
  AGE(return_date, rental_date) AS rental_days
FROM rental AS r 
WHERE 
  -- Use an INTERVAL for the upper bound of the rental_date 
  rental_date BETWEEN CAST('2005-05-01' AS DATE)
   AND CAST('2005-05-01' AS DATE) + INTERVAL '90 day';


##E.g. 
SELECT 
  c.first_name || ' ' || c.last_name AS customer_name,
  f.title,
  r.rental_date,
  -- Extract the day of week date part from the rental_date
  EXTRACT(dow FROM r.rental_date) AS dayofweek,
  AGE(r.return_date, r.rental_date) AS rental_days,
  -- Use DATE_TRUNC to get days from the AGE function
  CASE WHEN DATE_TRUNC('day', AGE(r.return_date, r.rental_date)) > 
    f.rental_duration * INTERVAL '1' day 
  THEN TRUE 
  ELSE FALSE END AS past_due 
FROM 
  film AS f 
  INNER JOIN inventory AS i 
  	ON f.film_id = i.film_id 
  INNER JOIN rental AS r 
  	ON i.inventory_id = r.inventory_id 
  INNER JOIN customer AS c 
  	ON c.customer_id = r.customer_id 
WHERE 
  -- Use an INTERVAL for the upper bound of the rental_date 
  r.rental_date BETWEEN CAST('2005-05-01' AS DATE) 
  AND CAST('2005-05-01' AS DATE) + INTERVAL '90 day';

#**REFORMATTING STRING AND CHARACTER DATA**
----
##**STRING CONCATENATION USING || ||**
SELECT f_name,    
       l_name,   
       f_name || ' ' || l_name AS full_name  
FROM customer;

##**STRING CONCATENATION USING FUNCTIONS**
SELECT   
  CONCAT (first_name, ' ', last_name) AS full_name    
FROM customer;  


##**STRING CONCATENATION WITH NON-STRING INPUT USING || ||**
SELECT   
  customer_id || ': '  
  || first_name, || ' '  
  || last_name AS full_name      
FROM customer; 


##**STRING CONCATENATION WITH NON-STRING INPUT USING FUNCTIONS**
SELECT   
  CONCAT (customer_id, ' ' first_name, ' ', last_name)  AS full_name        
FROM customer; 

##**CHANGE CASE**
* UPPER
* LOWER
* INITCAP

##E.g. 
SELECT  
  UPPER (email)  
FROM customer; 


##**REPLACE CHARACTERS**
SELECT   
REPLACE (description, 'A Astounding', 'An Astounding') AS description  
FROM film;  

##**REVERSE**
SELECT  
  title,  
  REVERSE (title)  
FROM   
  film AS f;  


##E.g. 
SELECT   
  -- Concatenate the category name to coverted to uppercase  
  -- to the film title converted to title case  
  UPPER(c.name) || ': ' || INITCAP(f.title) AS film_category,  
  -- Convert the description column to lowercase  
  LOWER(f.description) AS description   
FROM   
  film AS f   
  INNER JOIN film_category AS fc   
  	ON f.film_id = fc.film_id   
  INNER JOIN category AS c   
  	ON fc.category_id = c.category_id;

#**PARSING STRING AND CHARACTER DATA**
* LENGTH
* CHAR_LENGTH
* POSITION
* STRPOS
* LEFT
* RIGHT
* SUBSTRING
* SUBSTR


##E.g. 
SELECT  
  -- Extract the characters to the left of the '@'  
  LEFT(email, POSITION('@' IN email)-1) AS username,  
  -- Extract the characters to the right of the '@'  
  SUBSTRING(email FROM POSITION('@' IN email)+1 FOR LENGTH(email)) AS domain  
FROM customer;

#**TRUNCATING AND PADDING STRING DATA**
* TRIM
* LTRIM
* RTRIM
* LPAD
* RPAD

##E.g. 
-- Concatenate the padded first_name and last_name   
SELECT   
	RPAD(first_name, LENGTH(first_name)+1) || last_name AS full_name  
FROM customer;   


##E.g. 
-- Concatenate the first_name and last_name and email  
SELECT   
	RPAD(first_name, LENGTH(first_name)+1)   
    || RPAD(last_name, LENGTH(last_name)+2, ' <')   
    || RPAD(email, LENGTH(email)+1, '>') AS full_email  
FROM customer;   

##E.g.
-- Concatenate the uppercase category name and film title  
SELECT   
  CONCAT(UPPER(c.name), ': ', f.title) AS film_category,   
  -- Truncate the description remove trailing whitespace  
  TRIM(LEFT(description, 50)) AS film_desc  
FROM   
  film AS f   
  INNER JOIN film_category AS fc   
  	ON f.film_id = fc.film_id   
  INNER JOIN category AS c   
  	ON fc.category_id = c.category_id;  

##E.g.
* Get the first 50 characters of the description column

* Determine the position of the last whitespace character of the truncated description column and subtract it from the number 50 as the second parameter in the first function above.

SELECT 
  UPPER(c.name) || ': ' || f.title AS film_category,   
  -- Truncate the description  without cutting off a word  
  LEFT(description, 50 -   
    -- Subtract the position of the first whitespace character  
    POSITION(  
      ' ' IN REVERSE(LEFT(description, 50))  
    )  
  )   
FROM   
  film AS f   
  INNER JOIN film_category AS fc   
  	ON f.film_id = fc.film_id   
  INNER JOIN category AS c   
  	ON fc.category_id = c.category_id;

#**SEARCH FULL-TEXT**

----

#**LIKE**

* Case sensitive

* _ wildcard: search one character

* % wildcard: search zero or more characters

----

#**FULL-TEXT SEARCH**

* to_tsvector: builtin function

* to_tsquery: builtinn function

* @@: match 

##**E.g. BASIC FULL-TEXT SEARCH**

-- Select the title and description  
SELECT title, description  
FROM film  
-- Convert the title to a tsvector and match it against the tsquery   
WHERE to_tsvector(title) @@ to_tsquery('elf');

#**EXTENDING POSTGRESQL**

----
#**USER-DEFINED DATA TYPES**

* CREATE TYPE: Create user-defined dtype in system table

* ENUM: dtype of custom unchanging list

##E.g. 
-- Create an enumerated data type, compass_position  
CREATE TYPE compass_position AS ENUM (  
  	-- Use the four cardinal directions  
  	'North',   
  	'South',  
  	'East',   
  	'West'  
);

#**Query system table pg_type**
SELECT typname_typcategory  
FROM pg_type  
WHERE typname = 'dayofweek'; 

##E.g. 
-- Confirm the new data type is in the pg_type system table  
SELECT typname, typcategory  
FROM pg_type  
WHERE typname='compass_position';  

#**Query information schema table**
SELECT column_name, data_type, udt_name    
FROM INFORMATION_SCHEMA.COLUMNS    
WHERE table_name = 'film';   

##E.g.
-- Select the column name, data type and udt name columns  
SELECT column_name, data_type, udt_name  
FROM INFORMATION_SCHEMA.COLUMNS   
-- Filter by the rating column in the film table  
WHERE column_name='rating' AND table_name='film';  

----

#**USER-DEFINED FUNCTIONS**

* CREATE FUNCTION

* $$: to be used in postgresql

CREATE FUNCTION squared (i integer) RETURNS integer $$     
  BEGIN      
    RETURN  i*i;            
  END:    
$$ LANGUAGE plpgsql ;

#**POSTGRESQL EXTENSIONS**
---

#**Common Extensions**
* PostGIS
* PostPic
* fuzzystrmatch
* pg_trgm

#**Query Available Extensions**
SELECT name  
FROM pg_available_extensions;

#**Query Installed Extensions**
SELECT extname  
FROM pg_extension;

#**Enable Available Extensions**
* CREATE EXTENSION

##E.g. 
--Enable the fuzystrmatch extension  
CREATE EXTENSION IF NOT EXISTS fuzzystrmatch;  
--Confirm that fuzzystrmatch has been enabled  
SELECT extname FROM pg_extension;  

----

#**USING FUZZYSTRMATCH**

#**LEVENSHTEIN: How many edits required (not case sensitive)**

##E.g.
SELECT levenshtein('GUMBO', 'GAMBOL'); 

----

#**USING PG_TRGM**

#**SIMILARITY : How similar based on trigram matching (not case sensitive)

##E.g.
SELECT similarity('GUMBO', 'GAMBOL'); 

----
##E.g. 
* Select the film title and description.
* Calculate the similarity between the title and description.

-- Select the title and description columns  
SELECT   
  title,   
  description,   
  -- Calculate the similarity  
  similarity(title, description)  
FROM   
  film  
ORDER BY similarity DESC;  

##E.g.
* Select the film title and film description.
* Calculate the levenshtein distance for the film title with the string JET NEIGHBOR.

-- Select the title and description columns  
SELECT    
  title,   
  description,   
  -- Calculate the levenshtein distance  
  levenshtein(title, 'JET NEIGHBOR') AS distance  
FROM   
  film  
ORDER BY 3  

##E.g.
* Select the title and description for all DVDs from the film table.

* Perform a full-text search by converting the description to a tsvector and match it to the phrase 'Astounding & Drama' using a tsquery in the WHERE clause.




-- Select the title and description columns  
SELECT    
  title,   
  description   
FROM   
  film   
WHERE 
  -- Match "Astounding & Drama" in the description  
  to_tsvector(description) @@   
  to_tsquery('Astounding & Drama');  


##E.g.
* Add a new column that calculates the similarity of the description with the phrase 'Astounding & Drama'.

* Sort the results by the new similarity column in descending order.

SELECT   
  title,   
  description,   
  -- Calculate the similarity  
  similarity(description, 'Astounding Drama')   
FROM   
  film   
WHERE 
  to_tsvector(description) @@   
  to_tsquery('Astounding & Drama')   
ORDER BY   
	similarity(description, 'Astounding Drama') DESC;

#**EXPLORATORY DATA ANALYSIS IN POSTGRESQL**
----

#**DATABASE**

* Entity relationship diagram - tables | columns | relationships

* NULL  - missing |IS NULL | IS NOT NULL

* COUNT (*) - # of rows 

  * COUNT (*) result is labelled count and can be used ORDER BY w/o aliasing 

* COUNT (col_name) - # of non-NULL values (total - null)

* COUNT (DISTINCT col_name)  - # of different non-NULL values

* SELECR DISTINCT col_name - disctinct values including NULL


#**FOREIGN KEYS**

* Reference single specific row
  
  * In different or same table

* Via a unique ID

  * Primary key column containing unique non_NULL values

* Values restricted to values in referenced column OR NULL

  * NULL indicates there is no relationship for that row

* Is a primary key from one table that appears in another table to link the two together


#**ENTITY RELATIONSHIP DIAGRAM**

* Foreign keys indicated by arrows between tables

* Value before colon is name of column in arrow originating table

* Value after colin is name of referenced column in arrow pointing to table

* Arrow pointing from and to same table means self-reference 


#**PRIMARY KEYS**

* Have border around them at the top of the diagram

* Uniquely identify rows in table 



#**COALESCE**

* Operates row by row

* Returns first non_NULL value checking columns in order

* Essential if value in more than 1 column


#**COLUMN CONSTRAINTS**

* Foreign key: value that exists in the referenced column, or NULL

* Primary key: unique, not NULL

* Unique: values must all be different except for NULL

* Not NULL: NULL not allowed - must have a value

* Check connstraints: conditions on the values
  * column1 > 0
  * columnA > columnB


#**COMMON DATA TYPES**

* Numeric
* Character
* Date / Time
* Boolean
* Etc..

#**CASTING WITH CAST() | ::**

* Changes data type Only for current query
* For single value or column
* SELECT CAST (value AS new_type)
* SELECT value::new_type 


#**NUMERIC DATA TYPES AND SUMMARY FUNCTIONS**

* Range: MIN and MAX
* Average (mean): AVG
* Variance (spread from mean): 
  * Population divides by # of values: VAR_POP
  * Sample divides by # of values - 1: VAR_SAMP | VARIANCE
* Standard deviation (square root of variance)
  * Population: STDDEV_POP
  * Sample: STDDEV_SAMP | STDDEV
* Round to specified decimal places: SELECT ROUND (value, 2)
* Always group by whrn posible